// For1
// let k = +prompt("Введите определёное число k")
//     n = +prompt("Введите, сколько раз нужно вывести число k")
//     a = 0;
// for(a; a < n; a++){
//     console.log(k);
// }


// For2
// let a = +prompt("Введите первое число a")
//     b = +prompt("Введите второе число b, при том, что a<b")
//     n = 0;
// for(a; a<=b; a++){
//     console.log(a);
//     n++;
// }
// console.log(`Количество чисел между a и b: ${n}`)


// For3
// let a = +prompt("Введите первое число a")
//     b = +prompt("Введите второе число b, при том, что a<b")
//     n = 0;
// for(let c = b-1; a<c; c--){
//     console.log(c);
//     n++;
// }
// console.log(`Количество чисел между a и b: ${n}`)


// For4
// let a = +prompt("Введите цену за 1 кг конфет")
//     b = 10;
// for(let c = 1; c <= b; c++){
//     console.log(`Цена ${c} кг конфет: ${a*c}`)
// }

// For5
// let a = +prompt("Введите цену за 1 кг конфет")
//     b = 1;
// for(let c = 0.1; c <= b; c+=0.1){
//     console.log(`Цена ${c} кг конфет: ${a*c} дол.`);
// }


// For6
// let a = +prompt("Введите цену за 1 кг конфет")
//     b = 2;
// for(let c = 1; c <= b; c+=0.2){
//     console.log(`Цена ${c} кг конфет: ${a*c} дол.`);
// }


// For7
// let a = +prompt("Введите первое число a")
//     b = +prompt("Введите второе число b, при том, что a<b")
//     s = 0;
// for(a; a<=b; a++){
//     s+=a
// }
// console.log(`Сумма всех целых чисел от a до b: ${s}`)


// For8
// let a = +prompt("Введите первое число a")
//     b = +prompt("Введите второе число b, при том, что a<b")
//     s = 1;
// for(a; a<=b; a++){
//     s*=a
// }
// console.log(`Произведение всех целых чисел от a до b: ${s}`)


// For9
// let a = +prompt("Введите первое число а")
//     b = +prompt("Введите второе число b")
//     s = 1;
// for(s; a <= b; a++){
//     s*=(a**2)
// }
// console.log(`Произведение квадратов всех целых чисел от a до b: ${s}`)


// For10
// let n = +prompt("Введите число n")
//     a = 1;
//     s = 0;
// for(s; a<=n; a++){
//     s+=(1/a);
// }
// console.log(`Заданная сумма равняеется ${s}`)


// For11
// let n = +prompt("Введите число n")
//     a = 0;
//     s = 0;
// for(s; a<=n; a++){
//     s+=(n + a)**2;
// }
// console.log(`Заданная сумма равняеется ${s}`)


// For12
// let n = +prompt("Введите количество умножителей")
//     s = 1;
//     a = 1.1;
//     k = 1;
// for(a; k<=n; a+=0.1){
//     s*=a;
//     k++;
// }
// console.log(`Произведение равняется ${s}`)


// For13
// let n = +prompt("Введите число слагаемых")
//     a = 1.1;
//     k1 = 1;
//     b = 1.2;
//     k2 = 2;
//     s1 = 0;
//     s2 = 0;
// for(a; k1<=n; a+=0.2){
//     s1+=a;
//     k1+=2;
// }
// for(b; k2<=n; b+=0.2){
//     s2-=b;
//     k2+=2;
// }
// console.log(s1 + s2)

// For14
// let n = +prompt("Введите число n")
//     s = 0;
//     k = 1;
// for(n; k<=n; k++){
//     s+=(2*k - 1);
//     console.log(`${k} в квадрате: ${s}`)
// }

// For15
// let a = +prompt("Введите значение числа а")
//     n = +prompt("Введите степень числа а")
// for(n; n<0; n=n){
    
// }
// console.log(a**n)

// For16
// let a = +prompt("Введите значение числа а")
//     n = +prompt("Введите степень числа а")
//     n0 = 1;
// for(n; n0<=n; n0++){
//     console.log(a**n0)
// }
